// Данные о мультсериалах
const seriesData = [
    { name: 'Скуби-Ду, где ты!', seasons: '2(25)', year: '1969—1970' },
    { name: 'Новые дела Скуби-Ду', seasons: '2(24)', year: '1972—1973' },
    { name: 'Скуби-Ду Шоу', seasons: '3(40)', year: '1976—1978' },
    { name: 'Весёлая Олимпиада Скуби', seasons: '2(24)', year: '1977—1978' },
    { name: 'Скуби и Скрэппи-Ду', seasons: '5(62)', year: '1979—1980' },
    { name: 'Скуби и Скрэппи-Ду (короткометражные)', seasons: '3(99)', year: '1980—1982' },
    { name: 'Новые приключения Скуби и Скрэппи', seasons: '2(52)', year: '1983—1984' },
    { name: '12 призраков Скуби-Ду', seasons: '1(13)', year: '1985' },
    { name: 'Щенок по кличке Скуби-Ду', seasons: '4(30)', year: '1988—1991' },
    { name: 'Что новенького, Скуби-Ду?', seasons: '3(42)', year: '2002—2005' },
    { name: 'Шэгги и Скуби-Ду ключ найдут!', seasons: '2(26)', year: '2006—2008' },
    { name: 'Скуби-Ду: Мистическая корпорация', seasons: '2(52)', year: '2010—2013' },
    { name: 'Будь классным, Скуби-Ду!', seasons: '2(52)', year: '2015 — 2018' },
    { name: 'Скуби-Ду и угадай кто?', seasons: '2(52)', year: '2019—2021' },
    { name: 'Велма', seasons: '2(20)', year: '2023' }
];

// Данные о специальных эпизодах
const specialEpisodesData = [
    { name: 'Скуби-Ду! Жуткие игры', year: '2012' },
    { name: 'Скуби-Ду! Отдых с привидениями', year: '2012' },
    { name: 'Скуби-Ду

